<template>
    <h3>Коментарии по результатам выполнения задания:</h3>
    <ul>
        <li>По подходу - развернул Laravel</li>
        <li>подключил VUE (были небольшие трудности с VITE, пришлось гуглить и изучать вопрос)</li>
        <li>Подключил UIKIT3 и немного украсил страницу</li>
        <li>Создал роутер и маршруты для VUE</li>
        <li>Подключил DataTables (были труднисти в связке с VITE и VUE, пришлось гуглить)</li>
    </ul>
    <p>Общее затраченное время - до 4-ёх часов, из ккоторых около 2.5 - решение проблем с VUE + VITE + DataTables</p>


    <h3>Описание работы:</h3>
    <p>Ваша задача как младшего/среднего разработчика PHP/Vue — создать веб-страницу с боковым меню, содержащим три кнопки, на которые можно нажимать, и логотип, на который нельзя нажимать. Каждая кнопка будет переходить на другую страницу, и на каждой странице будет три таблицы с разными именами, но потенциально содержащие один и тот же контент. Кроме того, одна из страниц должна включать функцию разбиения на страницы.</p>

    <h3>Ожидания:</h3>
    <p>Используйте PHP и Vue.js для реализации веб-страницы.
        Убедитесь, что боковое меню остается фиксированным и видимым на всех страницах.
        Логотип должен быть некликабельным.
        Каждая кнопка должна переходить на другую страницу без перезагрузки всей страницы.
        Таблицы должны иметь разные имена и могут содержать одинаковое содержимое.
        Реализуйте разбиение на страницы на одной из страниц, чтобы отображать ограниченное количество записей таблицы на странице.
        Примените соответствующие стили, чтобы сделать страницу визуально привлекательной и отзывчивой.
        Поддерживайте чистую и организованную структуру кода.
        При необходимости используйте правильную обработку ошибок и проверку.
        Убедитесь, что окончательное решение совместимо с разными браузерами и хорошо работает в основных современных браузерах.</p>

    <h3>Подробности подачи:</h3>
    <p>При отправке тестового задания просьба предоставить следующую информацию:
        Подробное текстовое описание вашего подхода и любых предположений, сделанных во время разработки.
        Опубликованная ссылка, по которой мы можем просмотреть и протестировать веб-страницу.
        Общее время, затраченное вами на выполнение задачи.
        Примечание. Не стесняйтесь использовать любые дополнительные библиотеки или платформы, если это необходимо для выполнения задачи.
        Удачи в выполнении тестового задания! Мы с нетерпением ждем рассмотрения вашей заявки</p>

</template>

<script>
import {defineComponent} from "vue";

export default defineComponent({
    components: {},
    setup() {
        return {};
    },
});
</script>

<style scoped>

</style>
